[{"content":"My Stuff griz.sh griz.sh/tech griz.sh/griz tech.griz.sh docs.griz.sh ","date":1508426775,"description":"GRIZText about this post","lastmod":"2019-10-26T15:26:15Z","objectID":"3976528693a0108357f4928017600865","permalink":"https://docs.griz.sh/","publishdate":"2018-11-23T15:26:15Z","title":"GRIZH ome title"},{"content":"griz.sh is my site. I run it on a multinode bare metal kubernetes cluster. If it seems slow, it\u0026amp;rsquo;s because we are on point to point protocol for internet. At the time of making this about page I have 3 seperate apps running. 2 are made with hugo and deployed with nginx deployments, and content is filled by rsyncing to the pvc. The 3rd is a multiapp django application. I deploy static content with white noise and use gunicorn for the webserver. Instead of using nginx to route traffic I route with istio.\ngriz.sh/griz is where I render my database for my dog training griz.sh/tech is where I render my database for tech videos tech.griz.sh is where I have my tech journal. This is just random notes and thoughts. It\u0026amp;rsquo;s been helpful in the past when recreating stuff. docs.griz.sh this is this site. I\u0026amp;rsquo;ll make documentatino here for myself and others. Me and griz ","date":1768521600,"description":"","lastmod":"2026-01-16T00:00:00Z","objectID":"6083a88ee3411b0d17ce02d738f69d47","permalink":"https://docs.griz.sh/about/","publishdate":"2026-01-16T00:00:00Z","title":"About Griz Docs"},{"content":"My walkthrough Building a hugo site part 1\nPrerequisites install hugo cli install git make github account Installation brew install hugo # mac sudo pacman -S hugo # arch sudo apt install hugo # debian sudo dnf install hugo # fedora choco install hugo-extended # windows From hugo\u0026amp;rsquo;s quickstart guide hugo version hugo new site quickstart cd quickstart git init git submodule add https://github.com/theNewDynamic/gohugo-theme-ananke.git themes/ananke echo \u0026amp;#34;theme = \u0026amp;#39;ananke\u0026amp;#39;\u0026amp;#34; \u0026amp;gt;\u0026amp;gt; hugo.toml hugo server How do we use hugo? For the most part we do everything from the content folder. Make your markdown files as layed out in whatever theme you choose. Then we test with hugo server and check out how it looks at localhost:1313 from a browser. When we are ready to make our executables we run hugo then rsync the contents of the public directory to our pvc.\nConfiguration You may specify options in hugo.toml (or hugo.yaml/hugo.json) of your site to make use of this theme\u0026amp;rsquo;s features.\nI used to go through and change eveyrthing to yaml, but I find it\u0026amp;rsquo;s easier to just grab a templates example toml/json/yaml. If they don\u0026amp;rsquo;t have an example config file, I won\u0026amp;rsquo;t use that template. Not trying to read code with a tool like this.\nSome templates require node. Anything that has npm in the instructions requires node to be installed. I pretty much just avoid those ones. npm package files are pretty heavy, probably the heaviest files in software development. If I need node, then I might as well use a real framework.\nI\u0026amp;rsquo;ll leave more chapters for more detailed portions of using hugo.\nExample of screen shot for this template. ","date":1768836375,"description":"Description not needed","lastmod":"2026-01-19T15:26:15Z","objectID":"aef98fdafc4d07fbbf061f1fbe0d2e69","permalink":"https://docs.griz.sh/hugo/","publishdate":"2018-12-08T15:26:15Z","title":"Hugo"},{"content":"Package manager install for you non linux people windows windows button and open cmd terminal @\u0026amp;quot;%SystemRoot%\\System32\\WindowsPowerShell\\v1.0\\powershell.exe\u0026amp;quot; -NoProfile -InputFormat None -ExecutionPolicy Bypass -Command \u0026amp;quot;[System.Net.ServicePointManager]::SecurityProtocol = 3072; iex ((New-Object System.Net.WebClient).DownloadString(\u0026#39;https://community.chocolatey.org/install.ps1\u0026#39;))\u0026amp;quot; \u0026amp;amp;\u0026amp;amp; SET \u0026amp;quot;PATH=%PATH%;%ALLUSERSPROFILE%\\chocolatey\\bin\u0026amp;quot; or with powershell Set-ExecutionPolicy Bypass -Scope Process -Force; [System.Net.ServicePointManager]::SecurityProtocol = [System.Net.ServicePointManager]::SecurityProtocol -bor 3072; iex ((New-Object System.Net.WebClient).DownloadString(\u0026#39;https://community.chocolatey.org/install.ps1\u0026#39;)) Real Windows instructions Pick a linux distro, i like omarchy, and dual boot your os, or better just overwrite the full partition. Mac test\nopen up the terminal /bin/bash -c \u0026amp;quot;$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)\u0026amp;quot; Real Mac instructions Install ashi linux,curl https://alx.sh | sh test Install hugo brew install hugo # mac sudo pacman -S hugo # arch sudo apt install hugo # ubuntu sudo apt-get install hugo # debian sudo dnf install hugo # fedora choco install hugo-extended # windows Install git Windows Click here to download from here. follow instructions. Or here is probably better because you get a bash terminal too Mac brew install git linux any package manager can install git. ","date":1768577175,"description":"Description not needed","lastmod":"2026-01-16T15:26:15Z","objectID":"2a2b8a754cef4f89f19b227754202090","permalink":"https://docs.griz.sh/hugo/installation/","publishdate":"2026-01-16T15:26:15Z","title":"Hugo installation"},{"content":"Hugo Content All your markdown files in the content and content/child directories are what\u0026amp;rsquo;s used to render the html later. This is why I like an example site. Different themes set up static files and folders differently. They usually have good instructions; however, I think it\u0026amp;rsquo;s easiest just to grab an example site and edit everything in the content folder, one file at a time and then check it with hugo server.\nEach theme also has a header key value pair header that is used in rendering the content. Here\u0026amp;rsquo;s what this page looks like:\n--- title: \u0026amp;#34;Modifying Hugo Content\u0026amp;#34; date: 2026-01-16T15:26:15Z lastmod: 2026-01-16T15:26:15Z publishdate: 2026-01-16T15:26:15Z draft: false weight: 2 description: Description not needed --- The weight tells this site where to place the order of the folders. Lower numbers go higher, higher numbers go lower. Some themes order their lists with the date. On this particular theme the description seems pretty useless. It can be annoying to remember how each header is supposed to be engineered, so to avoid mistakes I create new markdown files from the terminal with the head command. For this one I used head -8 picking_a_template.md \u0026amp;gt; modifying_hugo.md.\nThen when I opened the file I just edited the title.\nFor the date, if your a vim user from inside vim run: :r !date -u \u0026#39;+%Y-%m-%dT%H:%M:%SZ\u0026#39;.\n","date":1768577175,"description":"Description not needed","lastmod":"2026-01-16T15:26:15Z","objectID":"3bf4466616ea86fe305c18a8bee062bd","permalink":"https://docs.griz.sh/hugo/modifying_hugo/","publishdate":"2026-01-16T15:26:15Z","title":"Modifying Hugo Content"},{"content":"Hugo Themes Official Themes You can probably find unofficial themes with a google search, but this is good enough for me. For this site I clicked the tag docs on the side, and looked through a few. I chose this one because it\u0026amp;rsquo;s simple, has no npm packages, and has an example site that\u0026amp;rsquo;s ready for use.\nIf you want something fancier, you pick a theme and look through the setup instructions. Many fancy themes rely on sass or npm, use your package manager to install what is missing. Come to me if you have trouble, and I can walk you through a specific setup.\n","date":1768577175,"description":"Description not needed","lastmod":"2026-01-16T15:26:15Z","objectID":"6e35d8759de09791f0d10c590cf7ab38","permalink":"https://docs.griz.sh/hugo/picking_a_template/","publishdate":"2026-01-16T15:26:15Z","title":"Hugo Picking a template"},{"categories":["Development","golang"],"content":"Hugo uses the excellent Go html/template library for its template engine. It is an extremely lightweight engine that provides a very small amount of logic. In our experience that it is just the right amount of logic to be able to create a good static website. If you have used other template systems from different languages or frameworks you will find a lot of similarities in Go templates.\nThis document is a brief primer on using Go templates. The Go docs provide more details.\nIntroduction to Go Templates Go templates provide an extremely simple template language. It adheres to the belief that only the most basic of logic belongs in the template or view layer. One consequence of this simplicity is that Go templates parse very quickly.\nA unique characteristic of Go templates is they are content aware. Variables and content will be sanitized depending on the context of where they are used. More details can be found in the Go docs.\nBasic Syntax Golang templates are HTML files with the addition of variables and functions.\nGo variables and functions are accessible within {{ }}\nAccessing a predefined variable \u0026amp;ldquo;foo\u0026amp;rdquo;:\n{{ foo }} Parameters are separated using spaces\nCalling the add function with input of 1, 2:\n{{ add 1 2 }} Methods and fields are accessed via dot notation\nAccessing the Page Parameter \u0026amp;ldquo;bar\u0026amp;rdquo;\n{{ .Params.bar }} Parentheses can be used to group items together\n{{ if or (isset .Params \u0026amp;quot;alt\u0026amp;quot;) (isset .Params \u0026amp;quot;caption\u0026amp;quot;) }} Caption {{ end }} Variables Each Go template has a struct (object) made available to it. In hugo each template is passed either a page or a node struct depending on which type of page you are rendering. More details are available on the variables page.\nA variable is accessed by referencing the variable name.\n\u0026amp;lt;title\u0026amp;gt;{{ .Title }}\u0026amp;lt;/title\u0026amp;gt; Variables can also be defined and referenced.\n{{ $address := \u0026amp;quot;123 Main St.\u0026amp;quot;}} {{ $address }} Functions Go template ship with a few functions which …","date":1396396800,"description":"","lastmod":"2014-04-02T00:00:00Z","objectID":"4f1f56186d2fece779068cd43c2d5eb2","permalink":"https://docs.griz.sh/post/goisforlovers/","publishdate":"2014-04-02T00:00:00Z","tags":["go","golang","templates","themes","development"],"title":"Hugo is written in Go"}]